App/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Ресторан</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>АдресДоставки</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>250</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ДатаСоздания</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Статус</Name>
				<Type>
					<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Курьер</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ПлановоеВремяДоставки</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ФактическоеВремяДоставки</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ВремяДоставкиМинут</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>5</v8:Digits>
						<v8:FractionDigits>0</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>СуммаДокумента</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Name>Блюдо</Name>
						<Type>
							<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Количество</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>10</v8:Digits>
								<v8:FractionDigits>3</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Цена</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Сумма</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

App/Documents/Заказ/Forms/ФормаДокумента/Ext/Form/Module.bsl
Перем ПредыдущийРесторан;

// Форма документа Заказ.
// Клиентская логика: подстановка адреса клиента, подтверждение смены ресторана,
// подбор цены блюда, пересчет суммы без ошибок блокировок.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
		Объект.Дата = Объект.ДатаСоздания;
	КонецЕсли;

	ПредыдущийРесторан = Объект.Ресторан;

КонецПроцедуры

// Клиент

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	ОбновитьАдресДоставкиКлиента();

КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресДоставкиКлиента()

	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Объект.АдресДоставки = Объект.Клиент.ОсновнойАдресДоставки;
	Иначе
		Объект.АдресДоставки = "";
	КонецЕсли;

КонецПроцедуры

// Ресторан

&НаКлиенте
Процедура РесторанПриИзменении(Элемент)

	Если НЕ ТребуетсяПодтверждениеСменыРесторана() Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("РесторанПриИзмененииЗавершение", ЭтотОбъект);
	ТекстВопроса = "Состав заказа относится к другому ресторану. Очистить состав заказа?";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура РесторанПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьСоставНаСервере();
	Иначе
		ВернутьПредыдущийРесторанНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТребуетсяПодтверждениеСменыРесторана()

	Если Объект.Ресторан = ПредыдущийРесторан Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Объект.Состав.Количество() = 0 Тогда
		ПредыдущийРесторан = Объект.Ресторан;
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ОчиститьСоставНаСервере()

	Объект.Состав.Очистить();
	ПредыдущийРесторан = Объект.Ресторан;
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ВернутьПредыдущийРесторанНаСервере()

	Объект.Ресторан = ПредыдущийРесторан;

КонецПроцедуры

// Табличная часть Состав

&НаКлиенте
Процедура СоставБлюдоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущиеДанные.Блюдо) Тогда
		ТекущиеДанные.Цена = ПолучитьЦенуБлюдаНаСервере(ТекущиеДанные.Блюдо);
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;

	ПересчитатьСтрокуСостава(ТекущиеДанные);
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СоставСтрокаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПересчитатьСтрокуСостава(ТекущиеДанные);
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СоставПослеУдаленияСтроки(Элемент)

	ПересчитатьИтогиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуСостава(СтрокаСостава)

	СтрокаСостава.Сумма = Окр(СтрокаСостава.Количество * СтрокаСостава.Цена, 2);

КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуБлюдаНаСервере(Блюдо)

	Цена = Документы.Заказ.ПолучитьЦенуБлюда(Блюдо, Объект.Дата);
	Если Цена = 0 Тогда
		Сообщить("Для блюда """ + Строка(Блюдо) + """ не установлена цена на дату заказа.", СтатусСообщения.Внимание);
	КонецЕсли;

	Возврат Цена;

КонецФункции

&НаСервере
Процедура ПересчитатьИтогиНаСервере()

	Объект.СуммаДокумента = Окр(Объект.Состав.Итог("Сумма"), 2);

КонецПроцедуры
